[
    {
        "date": "01/08/2024",
        "text": "Tried to impress my date by taking them to the top of the CN Tower. Forgot my fear of heights and clung to the railing for the entire ride. Needless to say, we didn't go back."
    },
    {
        "date": "02/08/2024",
        "text": "Accidentally took the wrong streetcar and ended up in Scarborough instead of downtown. Spent the day exploring unfamiliar neighborhoods and meeting random strangers."
    },
    {
        "date": "03/08/2024",
        "text": "Thought it would be fun to join a spontaneous flash mob in Yonge-Dundas Square. Ended up stepping on two people’s feet and running away before anyone noticed."
    },
    {
        "date": "04/08/2024",
        "text": "Admitted to my friends that I still binge-watch shows on Netflix instead of exploring Toronto’s vibrant theater scene. They were not impressed."
    },
    {
        "date": "05/08/2024",
        "text": "Went to Kensington Market dressed as a tourist to take selfies. Got lost among the locals and had to ask for directions in broken French."
    },
    {
        "date": "06/08/2024",
        "text": "Tried to cook poutine at home and ended up burning the gravy. My kitchen smelled like a deep fryer disaster for hours."
    },
    {
        "date": "07/08/2024",
        "text": "I confessed to my coworker that I’ve been secretly taking Toronto Raptors merchandise to bed every night. They laughed but now I can’t find my stuff."
    },
    {
        "date": "08/08/2024",
        "text": "Went to a Drake concert and accidentally spilled my drink on the stage. Drake noticed and gave me a nod, but my embarrassment is unmatched."
    },
    {
        "date": "09/08/2024",
        "text": "Admitted to getting lost in the PATH for over an hour. It was cold, dark, and I ended up ordering pizza delivered to a random office."
    },
    {
        "date": "10/08/2024",
        "text": "Tried to impress my date with my knowledge of Toronto’s history, but mixed up the dates of the Battle of York and the founding of the city."
    },
    // Add more confessions as needed...
]
