[
    {
        "date": "19/12/2024",
        "text": "I'm sure this is a hot take in most circles, but i'm actually excited for them to get rid of the bike lanes. Maybe there will be less traffic!",
        "promoted": false
    },
    {
        "date": "19/12/2024",
        "text": "I see more and more of those tent cities at places like Trinity Bellwoods, and i think to myself... Maybe i should just call it quits and live in a damn tent. How bad could it be?",
        "promoted": false
    },
    {
        "date": "19/12/2024",
        "text": "I haven't tried Badiali and at this point I'm convinced there's no way its as good as everyone says. Or maybe I'm just coping...",
        "promoted": false
    },
    {
        "date": "20/12/2024",
        "text": "I've asked all my friends, people who have lived in Toronto their whole lives, and none of us have ever been up the CN Tower.",
        "promoted": false
    },
    {
        "date": "20/12/2024",
        "text": "I've had to call the police on my next door neighbors multiple times. They are always fighting and yelling at each other. I think I'm done tho. no more calls from me! we'll let fate decide what happens there...",
        "promoted": false
    },
    {
        "date": "20/12/2024",
        "text": "Pizza Pizza is the best Pizza in the city. Who else is open at 2am when pizza is the most crucial?!",
        "promoted": false
    },
    {
        "date": "21/12/2024",
        "text": "My condo building has a gym, but I’ve never actually worked out there. I just go down in my yoga pants, take a few selfies, and head back up. My partner is convinced I’m getting “super fit” and keeps talking about my “dedication.”",
        "promoted": false
    },
    {
        "date": "21/12/2024",
        "text": "I was late to work because I grabbed a coffee at a trendy cafe on Queen Street. Told my boss I got stuck on the TTC when really I spent 15 minutes trying to get the perfect Instagram shot of my latte art.",
        "promoted": false
    },
    {
        "date": "21/12/2024",
        "text": "When my mom visits from out of town, I bring her to St. Lawrence Market and act like I’m a big “foodie.” In reality, half the time I’m surviving on Uber Eats and frozen pizza, but she thinks I’m basically the next Jamie Oliver.",
        "promoted": false
    },
    {
        "date": "22/12/2024",
        "text": "I keep a non-existent “big project deadline” on my calendar every two weeks so I have an excuse to bail on social plans. Everyone’s convinced I’m working on some top-secret hustle but I don't even work at my dayjob hardly lol",
        "promoted": false
    },
    {
        "date": "22/12/2024",
        "text": "I once lied about being a big Raptors fan to a date because he seemed so passionate about it. Now I watch YouTube highlights frantically before we hang out just to keep up appearances.",
        "promoted": false
    },
    {
        "date": "22/12/2024",
        "text": "I told my landlord I have “severe dust allergies” so I couldn’t possibly take my shoes off indoors for showings. Truth is, I just hate tying my laces again and again.",
        "promoted": false
    }
]
