[
    {
        "date": "01/08/2024",
        "text": "Tried to impress my date by taking them to the top of the CN Tower. Forgot my fear of heights and clung to the railing for the entire ride. Needless to say, we didn't go back."
    },
    {
        "date": "02/08/2024",
        "text": "Accidentally took the wrong streetcar and ended up in Scarborough instead of downtown. Spent the day exploring unfamiliar neighborhoods and meeting random strangers."
    },
    {
        "date": "03/08/2024",
        "text": "Thought it would be fun to join a spontaneous flash mob in Yonge-Dundas Square. Ended up stepping on two people’s feet and running away before anyone noticed."
    },
    {
        "date": "04/08/2024",
        "text": "Admitted to my friends that I still binge-watch shows on Netflix instead of exploring Toronto’s vibrant theater scene. They were not impressed."
    },
    {
        "date": "05/08/2024",
        "text": "Went to Kensington Market dressed as a tourist to take selfies. Got lost among the locals and had to ask for directions in broken French."
    },
    {
        "date": "06/08/2024",
        "text": "Tried to cook poutine at home and ended up burning the gravy. My kitchen smelled like a deep fryer disaster for hours."
    },
    {
        "date": "07/08/2024",
        "text": "I confessed to my coworker that I’ve been secretly taking Toronto Raptors merchandise to bed every night. They laughed but now I can’t find my stuff."
    },
    {
        "date": "08/08/2024",
        "text": "Went to a Drake concert and accidentally spilled my drink on the stage. Drake noticed and gave me a nod, but my embarrassment is unmatched."
    },
    {
        "date": "09/08/2024",
        "text": "Admitted to getting lost in the PATH for over an hour. It was cold, dark, and I ended up ordering pizza delivered to a random office."
    },
    {
        "date": "10/08/2024",
        "text": "Tried to impress my date with my knowledge of Toronto’s history, but mixed up the dates of the Battle of York and the founding of the city."
    },
    {
        "date": "11/08/2024",
        "text": "Confessed that I’ve been using my Uber Eats orders to binge-watch documentaries about Toronto’s hidden spots. Now I need a new hobby."
    },
    {
        "date": "12/08/2024",
        "text": "Went ice skating at Nathan Phillips Square and fell spectacularly in front of a crowd. Tried to laugh it off, but my pride is bruised."
    },
    {
        "date": "13/08/2024",
        "text": "Admitted to my friends that I’ve been secretly jealous of tourists taking photos of me in front of the CN Tower. It’s humiliating."
    },
    {
        "date": "14/08/2024",
        "text": "Joined a local trivia night to show off my Toronto knowledge, but didn’t know the difference between the Annex and Cabbagetown. Got every answer wrong."
    },
    {
        "date": "15/08/2024",
        "text": "Tried to be romantic by renting a tandem bike on the Martin Goodman Trail. We couldn't coordinate our pedaling and crashed into a group of joggers."
    },
    {
        "date": "16/08/2024",
        "text": "Confessed that I’ve been stealing French fries from Tim Hortons for years. My obsession with the sauce has no bounds."
    },
    {
        "date": "17/08/2024",
        "text": "Went to a yoga class at a trendy Toronto studio and realized halfway through that I have zero flexibility. Ended up tangled in my own limbs."
    },
    {
        "date": "18/08/2024",
        "text": "Admitted to spending more time scrolling through TikTok videos about Toronto secrets than actually exploring the city."
    },
    {
        "date": "19/08/2024",
        "text": "Tried to surprise my partner with a picnic in High Park, but forgot the blanket and everything we ate got dirty from the grass."
    },
    {
        "date": "20/08/2024",
        "text": "Confessed that I still use Google Maps to navigate downtown Toronto despite knowing all the streets by heart. Technology wins."
    },
    {
        "date": "21/08/2024",
        "text": "Went to a masquerade ball in Toronto and forgot my mask at home. Spent the night feeling exposed and underdressed."
    },
    {
        "date": "22/08/2024",
        "text": "Admitted to my friends that I’ve been taking selfies with the Queen’s Park squirrels because I’m too shy to take them with people."
    },
    {
        "date": "23/08/2024",
        "text": "Tried to impress a date by dancing at a local club, but my two left feet had other plans. Ended up bumping into everyone on the dance floor."
    },
    {
        "date": "24/08/2024",
        "text": "Confessed that I’ve been secretly using my bicycle to escape awkward conversations in crowded Toronto cafes."
    },
    {
        "date": "25/08/2024",
        "text": "Went to a trendy Toronto rooftop bar and spilled my drink all over the terrace. Tried to act cool, but everyone saw."
    },
    {
        "date": "26/08/2024",
        "text": "Admitted that I’ve been too scared to try the new escape room downtown, even though I’ve heard it’s Toronto’s latest obsession."
    },
    {
        "date": "27/08/2024",
        "text": "Tried to make friends at a Toronto meetup by sharing my life story, but it turned into an unsolicited therapy session. Oops."
    },
    {
        "date": "28/08/2024",
        "text": "Confessed that I’ve been avoiding attending the Toronto International Film Festival because I can’t handle spoilers."
    },
    {
        "date": "29/08/2024",
        "text": "Went to a hot yoga class in downtown Toronto and realized too late that I'm not as flexible as I thought. Left looking like a pretzel."
    },
    {
        "date": "30/08/2024",
        "text": "Admitted to my friends that I’ve been using the Toronto Zoo as my personal Instagram backdrop because it's the only place I feel photogenic."
    },
    {
        "date": "31/08/2024",
        "text": "Tried to impress my date by showing off my knowledge of Toronto’s street art, but ended up confusing murals with graffiti tags. Art is subjective, right?"
    }
]
