[
    {
        "date": "01/06/2024",
        "text": "Thought it'd be funny to pretend to propose to my girlfriend with a Haribo ring. She said yes and got so excited before I could explain it was a joke. Panicked, and bought a real ring the same afternoon. Been married 14 years today. Never wanted to marry her in the first place."
    },
    {
        "date": "02/06/2024",
        "text": "I enjoy a cup of Bovril on a cold night but went to make one just there and I've run out. All I had was a tub of 'Pigs in Blankets' Bistro granules that are a year out of date. So I'm sitting here drinking a mugful of bacon flavored gravy. It's surprisingly nice."
    },
    {
        "date": "03/06/2024",
        "text": "Up until the age of 27 I thought the word knackered was spelt NAKED. Day to day this wasn't a huge problem. But sometimes I would text people and say something like 'I'm not going out, I am totally naked. You can come round here if you like?'"
    },
    {
        "date": "04/06/2024",
        "text": "Chemistry teacher told us that stomach acid is hydrochloric acid. I assumed that meant I could try drinking some. Trip to hospital with acid burns in mouth. Bad experience. Would not recommend. I learned a lesson that I expect most people don't feel the need to learn."
    },
    {
        "date": "05/06/2024",
        "text": "Was charged £48 for excess baggage by airline. Have just submitted a pile of subject access and freedom of information requests to said airline's legal/data protection team. Confident it'll cost them more than £48 in staff time to respond. I live for this pettiness. Cunts."
    },
    {
        "date": "06/06/2024",
        "text": "English, grew up in Malaysia. I played ping pong with a Chinese kid called Dennis. He didn't speak English and my Hokkien was bad. It dawned on me about 15 years later he was probably saying 'tennis'. Fucking mortified."
    },
    {
        "date": "07/06/2024",
        "text": "I am the pianist for an Anglican Church. I always position the grand piano so that it's a slight squeeze for some people when they come back round from communion. I could make the gap bigger, but then I'd lose my little bit of Sunday morning entertainment."
    },
    {
        "date": "08/06/2024",
        "text": "Tried to flirt with the bartender all night, but they were just being friendly. Now I'm embarrassed every time I walk into that bar."
    },
    {
        "date": "09/06/2024",
        "text": "Sent a flirty text to the wrong person and now I have to explain myself to my boss. Nothing like mixing business with pleasure... or disaster."
    },
    {
        "date": "10/06/2024",
        "text": "Wore mismatched shoes to a date and didn't realize it until halfway through the evening. She still loves me... I think."
    },
    {
        "date": "11/06/2024",
        "text": "Attempted to do a romantic dance with my partner, but stepped on their toes repeatedly. Still danced, but more carefully."
    },
    {
        "date": "12/06/2024",
        "text": "Tried to impress my friends by doing a backflip at a party. Landed face-first in the punch bowl. At least my friends are now calling me 'The Splash'."
    },
    {
        "date": "13/06/2024",
        "text": "Bought a fancy bottle of wine to impress my date, but spilled it as soon as we opened it. Cheers to bad luck."
    },
    {
        "date": "14/06/2024",
        "text": "Wore a flashy belt to a dinner date to show my style, but it was too flashy and distracted from the conversation."
    },
    {
        "date": "15/06/2024",
        "text": "Tried to serenade my crush with a guitar song, but forgot the lyrics and ended up singing nonsense. She laughed and gave me a thumbs up."
    },
    {
        "date": "16/06/2024",
        "text": "Bought matching outfits with my date to show our connection, but the colors clashed terribly. We still love each other though."
    },
    {
        "date": "17/06/2024",
        "text": "Attempted to juggle wine glasses at a party to impress my friends, but ended up knocking one over. Now I'm known as the 'Juggler of Spills'."
    },
    {
        "date": "18/06/2024",
        "text": "Wore a see-through shirt to a club to show off my new tattoos. Forgot it was too transparent. Had to cover up quickly."
    },
    {
        "date": "19/06/2024",
        "text": "Tried to be smooth by offering my jacket to a stranger, but realized too late it was my only jacket. They stayed warm though."
    },
    {
        "date": "20/06/2024",
        "text": "Wore a fake mustache to a costume party, but it kept falling off and revealing my identity. Mission failed."
    },
    {
        "date": "21/06/2024",
        "text": "Tried to impress my date with my cooking skills, but the meal was a disaster. We ordered takeout and laughed about it."
    },
    {
        "date": "22/06/2024",
        "text": "Bought a romantic playlist for dinner, but accidentally played heavy metal instead. Date thought it was a joke."
    },
    {
        "date": "23/06/2024",
        "text": "Attempted to flirt with someone at the gym, but tripped on the treadmill and face-planted. Still gym buddies now."
    },
    {
        "date": "24/06/2024",
        "text": "Wore a funny hat to a date to break the ice, but it was too funny and overshadowed the conversation."
    },
    {
        "date": "25/06/2024",
        "text": "Tried to impress by showing off my dance moves at a party, but stepped on someone's foot instead. Now I'm known as 'The Foot Stealer'."
    },
    {
        "date": "26/06/2024",
        "text": "Sent a romantic message to my crush, but autocorrect changed it to something awkward. Now I have to explain the typo."
    },
    {
        "date": "27/06/2024",
        "text": "Tried to take a romantic walk on the beach, slipped on the sand, and face-planted into the water. Wet and embarrassed."
    },
    {
        "date": "28/06/2024",
        "text": "Wore bright red pants to a job interview to stand out. They certainly stood out... from what I wanted."
    },
    {
        "date": "29/06/2024",
        "text": "Bought a bouquet of flowers for my date, but they were wilted by the time I handed them over. Still appreciated the gesture."
    },
    {
        "date": "30/06/2024",
        "text": "Attempted to do a magic trick at a party, but it failed spectacularly. Still, everyone applauded my effort."
    },
    {
        "date": "01/07/2024",
        "text": "Tried to flirt with someone at the gym, but tripped on the treadmill and face-planted. Still gym buddies now."
    },
    {
        "date": "02/07/2024",
        "text": "Wore a bright Hawaiian shirt to a formal event to stand out. They certainly stood out... from the dress code."
    },
    {
        "date": "03/07/2024",
        "text": "Attempted to dance salsa at a party, but stepped on someone's foot instead. Now I'm known as the 'Foot Stealer'."
    },
    {
        "date": "04/07/2024",
        "text": "Wore mismatched socks to a job interview to show my quirky side. They noticed and it was not a good first impression."
    },
    {
        "date": "05/07/2024",
        "text": "Bought a 'funny' costume for Halloween, but it was too revealing. Spent the night hiding behind doorways."
    },
    {
        "date": "06/07/2024",
        "text": "Tried to be smooth and offer my seat on the bus, but ended up sitting on their bag instead. Awkward."
    },
    {
        "date": "07/07/2024",
        "text": "Wore a flashy belt to a dinner date to show my style, but it was too flashy and distracted from the conversation."
    },
    {
        "date": "08/07/2024",
        "text": "Tried to serenade my crush with a guitar song, but forgot the lyrics and ended up singing nonsense. She laughed and gave me a thumbs up."
    },
    {
        "date": "09/07/2024",
        "text": "Spilled wine all over myself during a fancy dinner date. It was a sticky situation!"
    },
    {
        "date": "10/07/2024",
        "text": "Accidentally walked into the women's restroom while my phone was playing a loud romantic song. Stayed for a minute before realizing."
    },
    {
        "date": "11/07/2024",
        "text": "Wore a fake mustache to a costume party, but it kept falling off and revealing my identity. Mission failed."
    },
    {
        "date": "12/07/2024",
        "text": "Attempted to do a romantic dance with my partner, but stepped on their toes repeatedly. Still danced, but more carefully."
    },
    {
        "date": "13/07/2024",
        "text": "Tried to impress my date with my cooking skills, but the meal was a disaster. We ordered takeout and laughed about it."
    },
    {
        "date": "14/07/2024",
        "text": "Bought a romantic playlist for dinner, but accidentally played heavy metal instead. Date thought it was a joke."
    },
    {
        "date": "15/07/2024",
        "text": "Wore bright red pants to a job interview to stand out. They certainly stood out... from what I wanted."
    },
    {
        "date": "16/07/2024",
        "text": "Sent a romantic message to my crush, but autocorrect changed it to something awkward. Now I have to explain the typo."
    },
    {
        "date": "17/07/2024",
        "text": "Tried to take a romantic walk on the beach, slipped on the sand, and face-planted into the water. Wet and embarrassed."
    },
    {
        "date": "18/07/2024",
        "text": "Wore a see-through shirt to a club to show off my new tattoos. Forgot it was too transparent. Had to cover up quickly."
    },
    {
        "date": "19/07/2024",
        "text": "Attempted to juggle wine glasses at a party to impress my friends, but ended up knocking one over. Now I'm known as the 'Juggler of Spills'."
    },
    {
        "date": "20/07/2024",
        "text": "Bought a bouquet of flowers for my date, but they were wilted by the time I handed them over. Still appreciated the gesture."
    },
    {
        "date": "21/07/2024",
        "text": "Tried to impress by showing off my dance moves at a party, but stepped on someone's foot instead. Now I'm known as 'The Foot Stealer'."
    },
    {
        "date": "22/07/2024",
        "text": "Wore mismatched socks to a job interview to show my quirky side. They noticed and it was not a good first impression."
    },
    {
        "date": "23/07/2024",
        "text": "Attempted to do a magic trick at a party, but it failed spectacularly. Still, everyone applauded my effort."
    },
    {
        "date": "24/07/2024",
        "text": "Wore a funny hat to a date to break the ice, but it was too funny and overshadowed the conversation."
    },
    {
        "date": "25/07/2024",
        "text": "Bought a romantic playlist for dinner, but accidentally played heavy metal instead. Date thought it was a joke."
    },
    {
        "date": "26/07/2024",
        "text": "Wore a bright Hawaiian shirt to a formal event to stand out. They certainly stood out... from the dress code."
    },
    {
        "date": "27/07/2024",
        "text": "Attempted to flirt with someone at the gym, but tripped on the treadmill and face-planted. Still gym buddies now."
    },
    {
        "date": "28/07/2024",
        "text": "Wore bright red pants to a job interview to stand out. They certainly stood out... from what I wanted."
    },
    {
        "date": "29/07/2024",
        "text": "Attempted to do a romantic dance with my partner, but stepped on their toes repeatedly. Still danced, but more carefully."
    },
    {
        "date": "30/07/2024",
        "text": "Wore a see-through shirt to a club to show off my new tattoos. Forgot it was too transparent. Had to cover up quickly."
    },
    {
        "date": "31/07/2024",
        "text": "Sent a romantic message to my crush, but autocorrect changed it to something awkward. Now I have to explain the typo."
    }
]
