[
    {
        "date": "19/12/2024",
        "text": "I'm sure this is a hot take in most circles, but i'm actually excited for them to get rid of the bike lanes. Maybe there will be less traffic!",
        "promoted": false
    },
    {
        "date": "19/12/2024",
        "text": "I see more and more of those tent cities at places like Trinity Bellwoods, and i think to myself... Maybe i should just call it quits and live in a damn tent. How bad could it be?",
        "promoted": false
    },
    {
        "date": "19/12/2024",
        "text": "I haven't tried Badiali and at this point I'm convinced there's no way its as good as everyone says. Or maybe I'm just coping...",
        "promoted": false
    },
    {
        "date": "20/12/2024",
        "text": "I've asked all my friends, people who have lived in Toronto their whole lives, and none of us have ever been up the CN Tower.",
        "promoted": false
    },
    {
        "date": "20/12/2024",
        "text": "I've had to call the police on my next door neighbors multiple times. They are always fighting and yelling at each other. I think I'm done tho. no more calls from me! we'll let fate decide what happens there...",
        "promoted": false
    },
    {
        "date": "20/12/2024",
        "text": "Pizza Pizza is the best Pizza in the city. Who else is open at 2am when pizza is the most crucial?!",
        "promoted": false
    },
    {
        "date": "21/12/2024",
        "text": "My condo building has a gym, but I’ve never actually worked out there. I just go down in my yoga pants, take a few selfies, and head back up. My partner is convinced I’m getting “super fit” and keeps talking about my “dedication.”",
        "promoted": false
    },
    {
        "date": "21/12/2024",
        "text": "I was late to work because I grabbed a coffee at a trendy cafe on Queen Street. Told my boss I got stuck on the TTC when really I spent 15 minutes trying to get the perfect Instagram shot of my latte art.",
        "promoted": false
    },
    {
        "date": "21/12/2024",
        "text": "When my mom visits from out of town, I bring her to St. Lawrence Market and act like I’m a big “foodie.” In reality, half the time I’m surviving on Uber Eats and frozen pizza, but she thinks I’m basically the next Jamie Oliver.",
        "promoted": false
    },
    {
        "date": "22/12/2024",
        "text": "I keep a non-existent “big project deadline” on my calendar every two weeks so I have an excuse to bail on social plans. Everyone’s convinced I’m working on some top-secret hustle but I don't even work at my dayjob hardly lol",
        "promoted": false
    },
    {
        "date": "22/12/2024",
        "text": "I once lied about being a big Raptors fan to a date because he seemed so passionate about it. Now I watch YouTube highlights frantically before we hang out just to keep up appearances.",
        "promoted": false
    },
    {
        "date": "22/12/2024",
        "text": "I told my landlord I have “severe dust allergies” so I couldn’t possibly take my shoes off indoors for showings. Truth is, I just hate tying my laces again and again.",
        "promoted": false
    },
    {
        "date": "23/12/2024",
        "text": "My boss complimented me on my “professional background” during our Zoom call. Little did he know I was sitting in my car outside a Shoppers Drug Mart",
        "promoted": false
    },
    {
        "date": "23/12/2024",
        "text": "The union station wifi is surprisingly fast. It's actually better than the wifi I have at home...",
        "promoted": false
    },
    {
        "date": "23/12/2024",
        "text": "I tell my parents back home that the rent here is “totally manageable” and I’m “living my best life.” Meanwhile, my credit card is maxed out, and I’m sweating bullets every month.",
        "promoted": false
    },
    {
        "date": "24/12/2024",
        "text": "I tried to learn guitar to impress someone, but gave up after a week. Still the majority of my instagram posts have a guitar in them lol",
        "promoted": false
    },
    {
        "date": "24/12/2024",
        "text": "I politely refuse cake at birthday parties because I claim to be “watching my sugar.” The truth? I cannot stand the texture of frosting and it creeps me out.",
        "promoted": false
    },
    {
        "date": "24/12/2024",
        "text": "Whenever I see anyone from school post baby pictures on Facebook, I comment “Oh so cute!” while panic-liking the post. Deep down, babies terrify me and I’m fine never holding one in my life.",
        "promoted": false
    },
    {
        "date": "25/12/2024",
        "text": "Ive accidentally used my boyfriends toothbrush. Twice.",
        "promoted": false
    },
    {
        "date": "25/12/2024",
        "text": "Went to a potluck for christmas with cupcakes i made. I completely forgot to add sugar to them and they way i found out was eveyone's slightly uneasy face while trying them",
        "promoted": false
    },
    {
        "date": "25/12/2024",
        "text": "I always say “I’m going to donate these clothes” whenever I do a closet clear-out. But they sit in trash bags in my trunk for months because I never drop them off.",
        "promoted": false
    },
    {
        "date": "26/12/2024",
        "text": "I promised my coworker I'd split the cost of a birthday cake for another colleague. I never actually paid my share. just told him I'd etransfer it later, then conveniently forgot.",
        "promoted": false
    },
    {
        "date": "26/12/2024",
        "text": "Every christmas my neighbor gives me a jar of his homemade pickles because for some reason he thinks i love pickles. I don't.",
        "promoted": false
    },
    {
        "date": "26/12/2024",
        "text": "All the plants in my house are fake. Waaaay easier!",
        "promoted": false
    },
    {
        "date": "27/12/2024",
        "text": "I spend roughly 25% of all my work from home hours asleep.",
        "promoted": false
    },
    {
        "date": "27/12/2024",
        "text": "I always say I’m trying to cut down on screen time. Meanwhile, I track my daily phone usage, realize it’s insane, then close the app and pretend I never saw it. I don't think i'm going to check the stats anymore.",
        "promoted": false
    },
    {
        "date": "27/12/2024",
        "text": "As long as 'vegetarian' means I eat meat once a month, then yes, i'm a vegetarian like i tell all my friends.",
        "promoted": false
    },
    {
        "date": "28/12/2024",
        "text": "Back in 2017 I was being rebellious and would poop in peoples yards in my area. They thought there was a coyote problem.",
        "promoted": false
    },
    {
        "date": "28/12/2024",
        "text": "I actually like tim horton's coffee more than any gourmet coffees ive tried at fancy coffee shops or friends houses.",
        "promoted": false
    },
    {
        "date": "28/12/2024",
        "text": "If they told me how many times I had to drive around my kids to their after school stuff, weekend stuff, friends houses, etc. I might've reconsidered having kids...",
        "promoted": false
    },
    {
        "date": "29/12/2024",
        "text": "I’ve got all these people convinced that I’m a real struggling rock and roll musician who plays in a band. But the truth is, l’m on the Sunshine List.",
        "promoted": false
    },
    {
        "date": "29/12/2024",
        "text": "I went on a first date and mentioned I'm “done with hook-up culture.” The same night, I texted an ex for a booty call—because let’s face it, a sure thing beats small talk any day.",
        "promoted": false
    },
    {
        "date": "29/12/2024",
        "text": "I told my friends my new boyfriend was “the best I ever had.” Truth is, I said it just to make my ex jealous, and now I’m stuck hyping him up when it’s… fairly average.",
        "promoted": false
    },
    {
        "date": "30/12/2024",
        "text": "I once used the “I’m experimenting with open relationships” line as a polite way to break up with someone. I’m absolutely not open—just didn’t want the awkward “it’s not you, it’s me” chat.",
        "promoted": false
    },
    {
        "date": "30/12/2024",
        "text": "I have over 100 unread text messages and no intention of checking any of them.",
        "promoted": false
    },
    {
        "date": "30/12/2024",
        "text": "I keep saying that we “don’t keep secrets in this house,” yet I hide a stash of nice chocolates on the top shelf that my kids have no idea exists.",
        "promoted": false
    }
]
